# frozen_string_literal: true

cask_args appdir: '/Applications'

tap 'beeftornado/rmtree'
tap 'koekeishiya/formulae'
tap 'rs/tap'
tap 'hashicorp/tap'
tap 'kadwanev/brew'

brew 'readline'
brew 'xz'
brew 'zlib'
brew 'gdbm'
brew 'imagemagick'
brew 'autoconf'
brew 'pkgconf'

brew 'mysql@8.0'
brew 'redis'
brew 'sqlite3'

brew 'zsh'
brew 'neovim'
brew 'python@3'
brew 'rust'
brew 'vim'
brew 'git'
brew 'curl'
brew 'gh'
brew 'hub'
brew 'tig'
brew 'csvq'
brew 'fzf'
brew 'gnu-sed'
brew 'jq'
brew 'gojq'
brew 'ripgrep'
brew 'ripgrep-all'
brew 'fd'
brew 'gnupg'
brew 'coreutils'
brew 'findutils'
brew 'unar'
brew 'graphviz'
brew 'gibo'
brew 'stylua'
brew 'mise'
brew 'direnv'
brew 'vegeta'

brew 'rs/tap/jaggr'
brew 'rs/tap/jplot' if OS.mac?

brew 'hashicorp/tap/terraform'
brew 'hashicorp/tap/terraform-ls'

brew 'kadwanev/brew/retry'

cask 'iterm2'
cask 'kitty'
cask 'docker-desktop'
cask 'appcleaner'
cask 'rectangle'
cask 'visual-studio-code'
cask 'sequel-ace'
cask 'keyboardcleantool'
