# frozen_string_literal: true

cask_args appdir: '/Applications'

tap 'beeftornado/rmtree'
tap 'koekeishiya/formulae'
tap 'rs/tap'
tap 'hashicorp/tap'
tap 'kadwanev/brew'
tap 'golangci/tap'

brew 'readline'
brew 'xz'
brew 'zlib'
brew 'imagemagick'

brew 'mysql@8.0'
brew 'redis'
brew 'sqlite3'

brew 'zsh'
brew 'neovim'
brew 'vim'
brew 'git'
brew 'gh'
brew 'hub'
brew 'tig'
brew 'csvq'
brew 'fzf'
brew 'gnu-sed'
brew 'jq'
brew 'gojq'
brew 'ripgrep'
brew 'ripgrep-all'
brew 'fd'
brew 'gnupg'
brew 'coreutils'
brew 'findutils'
brew 'unar'
brew 'graphviz'
brew 'gibo'
brew 'stylua'

brew 'jaggr'
brew 'jplot'
brew 'vegeta'

brew 'terraform-ls'

brew 'kadwanev/brew/retry'

brew 'golangci/tap/golangci-lint'

cask 'iterm2'
brew 'kitty'
cask 'docker'
cask 'appcleaner'
# cask 'insomnia'
cask 'rectangle'
cask 'visual-studio-code'
cask 'sequel-ace'
cask 'google-japanese-ime'
cask 'keyboardcleantool'
